app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])
    article_params = params.require(:article).permit(:title,:description)
    @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2020-12-15 02:38:15.118748"], ["id", 1]]